// Задача: Вывести сумму двух чисел

// Объявляем две переменные при помощи целочисленного типа данных int

int number = 10;
int number1 = 10;

Console.Write("Сумма двух числе - ");
Console.WriteLine(number + number1);
